{
    "blockchain-basics": {
        "answer": "A blockchain is a distributed ledger technology that stores data across a network of nodes. Each block contains transactions and is cryptographically linked to the previous block, creating an immutable chain. The decentralized nature means no single entity controls the network. Consensus mechanisms like Proof of Work or Proof of Stake ensure all nodes agree on the valid state of the ledger. This makes blockchain secure and tamper-proof because altering any block would require changing all subsequent blocks and gaining control of the majority of nodes."
    },
    "smart-contracts": {
        "answer": "Smart contracts are self-executing programs stored on a blockchain like Ethereum. They automatically execute when predefined conditions in their code are met, without needing intermediaries. For example, a DeFi lending protocol uses smart contracts to automatically process loans when users deposit collateral. The benefits include trustless execution, transparency, and reduced costs. However, risks include bugs and vulnerabilities in the code that can be exploited, and gas fees required for execution. Once deployed, smart contracts are immutable, making security audits critical."
    },
    "defi-fundamentals": {
        "answer": "Decentralized Finance (DeFi) is an ecosystem of financial applications built on blockchain that operate without traditional intermediaries like banks. Unlike traditional finance, DeFi is permissionless, transparent, and accessible globally. Key applications include: 1) DEXs (Decentralized Exchanges) like Uniswap that use liquidity pools and automated market makers for token swaps, and 2) Lending protocols like Aave where users can earn yield by supplying assets or borrow against collateral. Benefits include 24/7 access, higher yields through yield farming, and full control of assets. Risks include smart contract vulnerabilities and impermanent loss."
    },
    "nft-concepts": {
        "answer": "NFTs (Non-Fungible Tokens) are unique digital tokens stored on a blockchain, typically using the ERC-721 standard. Unlike cryptocurrencies which are fungible (interchangeable), each NFT is distinct with its own metadata and properties, proving ownership of a specific digital or physical asset. Beyond digital art, NFTs are used for: 1) Gaming - representing in-game items, characters, or virtual land that players truly own and can trade on marketplaces, and 2) Ticketing - event tickets as NFTs prevent counterfeiting and enable secondary market sales with royalties to creators. NFTs provide verifiable ownership and authenticity."
    },
    "crypto-wallets": {
        "answer": "Cryptocurrency wallets are software or hardware that store your private keys, which are needed to sign transactions and access your crypto assets. Your public key (wallet address) is shared to receive funds, while your private key must remain secret. Hot wallets are connected to the internet (like MetaMask or mobile apps) offering convenience but higher security risk. Cold wallets (like Ledger or Trezor) store keys offline, providing maximum security for long-term storage. Key security practices include: never sharing your seed phrase (the 12-24 word recovery backup), using non-custodial wallets for self-custody, enabling 2FA, and keeping most funds in cold storage."
    },
    "consensus-mechanisms": {
        "answer": "Proof of Work (PoW) and Proof of Stake (PoS) are mechanisms for achieving agreement among blockchain nodes. In PoW (used by Bitcoin), miners compete to solve complex cryptographic puzzles using computational power. The first to solve it adds the next block and earns rewards. Advantages: highly secure, battle-tested. Disadvantages: extremely high energy consumption and potential centralization through mining pools. In PoS (used by Ethereum after the Merge), validators stake tokens as collateral and are randomly selected to propose blocks. Advantages: 99% less energy use, lower barrier to entry. Disadvantages: potential wealth centralization and newer security model. Both aim to prevent 51% attacks and ensure decentralization."
    }
}